brew "git"
brew "git-lfs"
brew "yarn"
brew "tmux"
brew "tmuxinator"
brew "nvm"
brew "redis"

brew "dockutil"
brew "mas"
brew "p7zip"
brew "python3"
brew "shfmt"
brew "thefuck"
brew "wget"
brew "xcv"
brew "duti"
brew "tldr"

cask "1password"
cask "1password-cli"
cask "gimp"
cask "docker"
cask "flux"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "firefox-developer-edition"
cask "karabiner-elements"
cask "logitech-camera-settings"
cask "meetingbar"
cask "insomnia"
cask "iterm2"
cask "sequel-ace"
cask "slack"
cask "telegram-desktop"
cask "tidal"
cask "tunnelblick"
cask "visual-studio-code"
cask "vivaldi"
cask "zoo"
personal_casks=(steam discord)

cask "docker"
