# specify a directory to install
cask_args appdir: "/Applications"

# taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"

# install packages
brew "asdf"
brew "cloudflared"
brew "cocoapods" 
brew "convox" 
brew "dockutil" 
brew "duti" 
brew "fzf"
brew "gnupg"
brew "grepcidr"
brew "jenv"
brew "mas" 
brew "p7zip" 
brew "python3" 
brew "rbenv"
brew "ruby-build"
brew "shfmt" 
brew "tldr"
brew "thefuck" 
brew "watchman" 
brew "wget" 
brew "xcv" 

# Casks
cask "1password"
# cask "1password-cli"
cask "android-studio"
cask "beekeeper-studio"
cask "docker"
cask "firefox-developer-edition"
cask "flipper"
cask "flux"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "gimp"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "logitech-camera-settings"
cask "meetingbar"
# cask "pgadmin4"
# cask "sequel-ace"
cask "slack"
cask "spotify"
cask "telegram-desktop"
# cask "tidal"
# cask "tunnelblick"
cask "visual-studio-code"
cask "vivaldi"
cask "zoom"

# Mac apps
mas "Magnet", id: 937984704
mas "Amphetamine", id: 441258766
# Very long running :/ 
# mas "XCode", id:497799835
# mas "Giphy", id: 668208984
# mas "Speedtest", id: 1153157709
# mas "Page", id: 409201541
